---
kind: other
id: Methods.T:Autodesk.Revit.DB.TessellatedShapeBuilder
source: html/34a77ed9-c195-7d13-e951-50f4be0c79c4.htm
---
# TessellatedShapeBuilder Methods

Adds a face to the currently open connected face set.